In [1]:
import pandas as pd

시리즈 클래스

In [2]:
#넘파이에서 제공하는 1차원 배열과 비슷하나 각 데이터의 의미를 표시하는 인덱스를 붙일 수 있음
#데이터 자체는 값(value)라고 함

In [3]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"]) #인덱스는 라벨
s #Series 클래스

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [5]:
pd.Series(range(10, 14)) #자동으로 인덱스 붙여줌

0    10
1    11
2    12
3    13
dtype: int64

In [6]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [7]:
s.values #value는 array !!!!!!!!!!

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [8]:
# name 속성 - 시리즈 데이터에 이름 붙일 수 있음
s.name = "인구" #이 데이터를 설명하는 이름
s.index.name = "도시" #인덱스의 이름으로 도시
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

시리즈 연산 (넘파이 배열이기에)

연산은 시리즈의 값(value)에만 적용되며 인덱스 값은 변하지 않음

In [9]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

시리즈 인덱싱

In [10]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [11]:
s[1]

3448737

In [12]:
s["부산"]

3448737

In [13]:
s["대구"]

2466052

In [14]:
#배열 인덱싱. 부분적인 값을 가지는 시리즈 자료형을 반환
# 자료으 ㅣ순서를 바꾸거나 특정항ㄴ ㅏㅈ료만 선택할 수 잇음.
s[ [0, 3, 1] ] #인덱스로 판정, 그 순서로 출력

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [17]:
s[["서울", "대구", "부산"]] #레이블 명으로

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [16]:
s[["부산", "대구", "부산"]]

도시
부산    3448737
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [18]:
s[ (250e4 < s) & (s < 500e4) ]  # 인구가 250만 초과, 500만 미만인 경우
#e4 : 0 4개
#불린 인덱싱

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [19]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [21]:
#슬라이싱을 해도 부분적인 시리즈를 반환한다.
#이 때 문자열 라벨을 이용한 슬라이싱을 하는 경우에는 숫자 인덱싱과 달리 콜론(:) 기호 뒤에 오는 값도 결과에 포함되므로 주의해야 한다.
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [22]:
s[1:3]  # 두번째(1)부터 세번째(2)까지 (네번째(3) 미포함)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [23]:
s["부산":"대구"]  # 부산에서 대구까지 (대구도 포함)
#컴퓨터 제공하는 인덱스 넘버와 판다스 내부 인덱스 넘버
#사람들이 지정해둔 인덱스 레이블을 가지고 하는 것과는 다름

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [24]:
# 만약 라벨 값이 문자열인 경우에는 인덱스 라벨이 속성인것처럼 점(.)을 이용하여 해당 인덱스 값에 접근할 수도 있다.
s0 = pd.Series(range(3), index=["a", "b", "c"])
s0

a    0
b    1
c    2
dtype: int64

In [25]:
s0.a

0

In [26]:
s.부산

3448737

시리즈와 딕셔너리 자료형

In [27]:
# 인덱스와 밸류
# 키와 밸류
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [28]:
"서울" in s  # 인덱스 라벨 중에 서울이 있는가

True

In [29]:
"대전" in s  # 인덱스 라벨 중에 대전이 있는가

False

In [30]:
for k, v in s.items():
    print("%s = %d" % (k, v))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

In [31]:
# 딕셔너리 객체에서 시리즈를 만들 수도 있다.
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [32]:
#딕셔너리의 원소는 순서를 가지지 않으므로 시리즈의 데이터도 순서가 보장되지 않는다.
# 만약 순서를 정하고 싶다면 인덱스를 리스트로 지정해야 한다.
s2 = pd.Series({"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158},
               index=["부산", "서울", "인천", "대전"]) #인덱스 넣어주면 그 순서로 들어감
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

인덱스 기반 연산

In [33]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [34]:
s2

부산    3393191
서울    9631482
인천    2632035
대전    1490158
dtype: int64

In [35]:
ds = s - s2
ds #대구대전은 서로간 없어서 연산 불가.

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [36]:
s.values - s2.values #인덱스값 다르니, 모르니 이렇게 하믄안댐

array([ 6511121, -6182745,   258416,   975894], dtype=int64)

NaN 값이 float 자료형에서만 가능하므로 다른 계산 결과도 모두 float 자료형

NaN이 아닌 값을 구하려면 notnull 메서드를 사용

In [37]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [38]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [39]:
#인구증가율
# s : 2015,  s2 : 2010
rs = ( (s - s2)/s2 ) * 100
rs

대구         NaN
대전         NaN
부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [40]:
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

데이터의 갱신, 추가, 삭제

In [41]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [42]:
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [43]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

데이터프레임 클래스

In [44]:
#이제는 열이 생김. 2차원
# 리스트나 1차원 배열 준비([], array)
# 딕셔너리로도 만들 수 있음
# 클래스 생성자에 넣어서도 만들 수 있음
data = {
    "2015": [9904312, 3448737, 2890451, 2466052], #칼럼명, value 4가지
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"] # 순서 지정
index = ["서울", "부산", "인천", "대구"] # 순서 지정
df = pd.DataFrame(data, index=index, columns=columns)
df
#DataFrame 대문자. 클래스

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [45]:
print(df)

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [46]:
# 공통 인덱스를 가지는 열 시리즈(column series)를 딕셔너리로 묶어놓은 것이라고 보는 것
# 2차원 (넘파이)배열 데이터는 모든 원소가 같은 자료형을 가져야 하지만
# 데이터프레임은 각 열(column)마다 자료형이 다를 수 있기 때문이다.
#값에 어디는 문자열, 어디는 숫자가 들어갈 수 있음. 각자 다른 형을 가질 수 있음.

In [47]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [48]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [49]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [50]:
df.index.name = "도시" #행인덱스에 대한 이름
df.columns.name = "특성" #열인덱스에 대한 이름
df
#멀티 인덱스, 인덱스가 여러개면 헷갈리니까 그때 이름을 많이 씀.

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [51]:
# 전치가능. 행렬이기 때문. 포함해서 가능.
df.T
#행의 인덱스 -> 열의 인덱스

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

열 데이터의 갱신, 추가, 삭제

In [52]:
 df["2010-2015 증가율"] * 100

도시
서울    2.83
부산    1.63
인천    9.82
대구    1.41
Name: 2010-2015 증가율, dtype: float64

In [53]:
# "2010-2015 증가율"이라는 이름의 열 추가
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df
#연산한 다음에 넣어주면 됨.

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [54]:
# "2005-2010 증가율"이라는 이름의 열 추가
( ( (df["2010"] - df["2005"]) / df["2005"] ) * 100).round(2)

도시
서울   -1.34
부산   -3.40
인천    4.54
대구   -0.99
dtype: float64

In [55]:
df["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [56]:
# "2010-2015 증가율"이라는 이름의 열 삭제
del df["2010-2015 증가율"]
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

열 인덱싱

In [58]:
# 데이터프레임을 인덱싱을 할 때도 열 라벨(column label)을 키값으로 생각하여 인덱싱을 할 수 있다.
# 하나의 열만 인덱싱하면 시리즈가 반환된다.
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [59]:
df["2010", "2015"] #인덱싱 하는 용도. 하나 더 감싸줘야함.

KeyError: ('2010', '2015')

In [60]:
# 여러개의 열을 인덱싱하면 부분적인 데이터프레임이 반환된다.
df[ ["2010", "2015"] ]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [61]:
# 2010이라는 열을 반환하면서 시리즈 자료형으로 변환
df[ "2010" ], type(df["2010"])

(도시
 서울    9631482
 부산    3393191
 인천    2632035
 대구    2431774
 Name: 2010, dtype: int64,
 pandas.core.series.Series)

In [62]:
# 2010이라는 열을 반환하면서 데이터프레임 자료형을 유지
df[ ["2010"] ] #차원을 강제로 올린 것.

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [63]:
 type(df[["2010"]])

pandas.core.frame.DataFrame

In [66]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [65]:
import numpy as np

In [67]:
df2[2] #칼럼명으로 조회한 것, 값을 넣으면 칼럼으로 판정함

0     2
1     6
2    10
Name: 2, dtype: int32

In [68]:
df2[[1, 2]] #칼럼 명이 조회된 것.

   1   2
0  1   2
1  5   6
2  9  10

행 인덱싱

In [69]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [70]:
df[:1] #행 인덱싱은 슬라이싱으로 !!!! 밸류는 많고, 칼럼은 단수이니.

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [71]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [72]:
df[1:3]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [74]:
df["서울":"인천"] #인천 포함됨.

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

개별 인덱싱

In [75]:
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

In [76]:
df["2015"]["서울"]

9904312

연습문제

In [97]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [100]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df[["수학"]]
df["수학"] #이게 시리즈

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [99]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[["국어", "영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [92]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
avg = df.average("국어","영어","수학")
avg

AttributeError: 'DataFrame' object has no attribute 'average'

In [101]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df["평균 점수"] = round(df.mean(axis=1), 2) #열방향으로 평균을 계산할거야
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [102]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자'] = 80 #칼럼명부터
df

C:\Users\nb772\AppData\Local\Temp\ipykernel_6868\1554999577.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80 #칼럼명부터

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  46.67

In [105]:
df["평균 점수"] = round(df.mean(axis=1),2)
df

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  59.79

In [106]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학  평균 점수
춘향  80  90  90  86.67

In [107]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.T['향단']

국어       70.0
영어       60.0
수학       80.0
평균 점수    70.0
Name: 향단, dtype: float64